// 预测卡密 预测规则
export var guessRules = {
    title:'预测卡密：',
    content:`1.购买本商品时可预测卡密所归属的球队，获得卡密后，预测的球队与卡密匹配即可获得免单购买机会\r\n2.单笔订单可预测1支球队，每匹配成功一条卡密均可获得一次免单机会\r\n3.免单机会可在创建订单时使用，免单的订单仍可进行卡密预测\r\n4.卡密中包含多支球队时，预测的球队与卡密中任意一支球队匹配则算预测成功\r\n5.若商品拼团完成，您有免单次数未用完，可联系客服退款 (退款额度=剩余免单次数*商品单价)\r\n6.预测结果以实际卡密中的球队为准`
}
// 商品详情 帮助规则
export var goodsDetailRules = [
    {title:'Q1：关于退款',desc:'超过拼团认购时限，认购未满员，所有款项将在3小时内原路返还，除此种情况，暂不提供其他退款服务'},
    {title:'Q2：如何保证原箱原盒？',desc:'商品上架前，平台会审核商家提供的原箱/原盒视频以及图片。卡片生厂商在生产过程中，有几率出现装箱误差，商品详情描述仅供参考，最终拆卡结果以实物为准。产品宣传图均为发行商官方制作，最终拆卡结果以实物为准。请各位卡友悉知'},
    {title:'Q3：拼成后多久拆卡？',desc:'拼团成功后24小时内在小程序内直播拆卡，拆卡后2个工作日内完成拆卡报告。如遇特殊情况需延长拆卡时间，平台将在购买须知中说明'},
    {title:'Q4：中卡后多久发货？',desc:'通常情况下，拆卡报告生成后2个工作日内完成发货。如遇港拆、美拆等特殊情况需延长发货时间，平台将在购买须知中说明'}
]
// 商品详情 帮助规则
export var goodsDetailHelp = [
    {content:'1.“卡世界”提供平台/技术支持，入驻商家提供商品、直播拆卡、售后服务。'},
    {content:'2.根据厂商官方公布的Checklist,组队方式分为随机球员、随机球队、随机位置等，每种方式对应一定的【拼团份数】，每一份对应一个随机卡密。'},
    {content:'3.【随机方式】若为即买即随，用户付款完成后，将获得对应下单份数的随机卡密；若为组满队伍，用户付款完成且认购满员后，用户将获得对应下单份数的随机卡密。'},
    {content:'4.认购满员后，商家将在小程序直播公示拆卡过程，并在直播结束后上传拆卡结果，完成后续发货工作。中卡的用户，获得实体卡片；未中卡用户，则无实体卡片，希望各位卡迷理性消费。'},
    {content:'5超过拼团【认购时限】，认购未满员，所有款项通过系统原路返还，除此种情况之外，平台方不提供退款服务。'}
]