<template>
	<view class="privacy-index">
		<view class="bottom-desc">第一条 本协议将构成您与杭州卡沃王科技有限公司（以下简称“我公司”）就 卡世界 平台（以下简称“平台”）之间具有约束力的法律文件。平台为第三方交易平台及卡牌产品（以下简称“产品”）服务发布者，平台（含小程序、网站、客户端等）所展示的产品/服务的标题、价格、详情等信息内容系由店铺经营者发布，其真实性、准确性和合法性均由平台店铺经营者负责。本平台提醒用户购买产品/服务前注意谨慎核实，对于店铺提供的产品本平台不承担任何责任。</view>
		<view class="bottom-desc">第二条 如用户对产品/服务的标题、价格、详情、卡牌组队规则等任何信息有任何疑问的，请在购买前与平台店铺经营者沟通确认；如用户发现店铺内有任何违法/侵权信息，请立即向平台举报并提供有效线索。</view>
		<view class="bottom-desc">第三条 对于使用本平台从事的相关行为、利用平台中所涉信息等，用户应秉着诚实、守信、善意之理念进行，不得有恶意欺骗、欺诈之行为，亦不得故意或过失损害本平台的合法权益。</view>
		<view class="bottom-desc">第四条 凡是在本平台从事相关行为的企业、团体、单位、个人，均视为具备独立从事民事活动的资格，对于因产品服务(包括但不限于产品出现污染、变质、损坏、缺失、灭失、发货或交货迟延)等而造成用户的任何损失，本平台不承担任何责任。</view>
		<view class="bottom-desc">第五条 本平台有权对产品信息(包括但不限于产品价格、规格、种类、型号)进行调整，对于用户因平台之调整行为而遭受的损失，本商城不承担任何责任。</view>
		<view class="bottom-desc">第六条 用户应严格按照本平台服务协议从事相关行为，如服务协议发生变更、修正，用户应按变更、修正后的协议执行，本平台不因协议之变更、修正而承担任何责任。</view>
		<view class="bottom-desc">第七条 为全方位服务用户，本商城提供客户服务 。</view>
		<view class="bottom-desc">第八条 本平台所刊载的所有资料及图表仅供参考使用。因技术更新和包装改进，产品描述或产品图片与实体产品之间若有细微差别，本平台均得免责。</view>
		<view class="bottom-desc">第九条 我们将在您的同意及确认下，通过注册等形式要求您提供一些个人资料，请您绝对放心，我们在未经您同意的情况下，绝对不会将您的任何资料以任何方式泄露给任何第三方。</view>
		<view class="bottom-desc">第十条 由于用户将个人密码告知他人或与他人共享注册帐户，由此导致的任何个人资料泄露，本平台免责。</view>
		<view class="bottom-desc">第十一条 任何由于黑客攻击、计算机病毒侵入或发作、因政府管制而造成的暂时性关闭等因素影响网络正常经营的不可抗力而造成的个人资料泄露、丢失、被盗用或被窜改等，本平台均得免责。</view>
		<view class="bottom-desc">第十二条 本平台如因系统维护或升级而需暂停服务时，将提前十二小时公告。若因线路及非本平台控制范围外的硬件故障或其它不可抗力而导致暂停服务，于暂停服务期间造成的一切不便与损失，本平台均得免责。</view>
		<view class="bottom-desc">第十三条 如果您在未满18周岁，您只能在父母或监护人的监护下使用本平台。 已满18周岁的成年人因任何原因不具备完全民事行为能力的，参照适用本协议之未成年人使用条款之相关约定。</view>
		<view class="bottom-desc">第十四条 凡以任何方式登陆本平台或直接、间接使用本平台资料者，视为自愿接受本平台用户协议的约束。</view>
		<view class="bottom-desc">第十五条 本平台的各项电子服务的所有权和运作权归上海范斯猫文化发展有限公司所有。用户同意所有注册协议条款并完成注册程序，才能成为本站的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</view>
		<view class="bottom-desc">第十六条 用户点击同意本协议的，即视为用户确认自己具有享受本平台服务和下单购物等相应的权利能力和行为能力，能够独立承担法律责任。</view>
		<view class="bottom-desc">第十七条 用户在注册过程中，应保证向本平台提供注册资料真实，用户同意其提供的注册资料，包括但不限于本人姓名、年龄、银行卡号等真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新相应资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且平台保留终止用户使用平台各项服务的权利。</view>
		<view class="bottom-desc">第十八条 本协议未涉及的问题参见国家有关法律法规，当本协议与国家法律法规冲突时，以国家法律法规为准。</view>
	</view>
</template>

<script lang="ts">
	import { Component } from "vue-property-decorator";
	import BaseNode from '../../base/BaseNode.vue';
	@Component({})
	export default class ClassName extends BaseNode {
		
		onLoad(query:any) {
			
		}
	}
</script>

<style lang="scss">
	.privacy-index{
		width: 100%;
		box-sizing: border-box;
		padding:20rpx
	}
	.bottom-desc{
		width: 100%;
		box-sizing: border-box;
		padding:0 20rpx;
		margin-top: 20rpx;
		font-size: 30rpx;
		
	}
</style>
