<template>
  <view class="privacy-index">
    <view class="bottom-desc" v-html="html"></view>
  </view>
</template>

<script lang="ts">
import { Component } from "vue-property-decorator";
import BaseNode from "../../base/BaseNode.vue";
@Component({})
export default class ClassName extends BaseNode {
  html = `【导言】
<br><br>
本协议约定杭州卡沃王科技有限公司（以下简称“卡世界”）与用户之间关于“卡世界”软件服务（以下简称“服务“）的权利义务。
当您使用“卡世界”，即表示您信赖我们对您的信息的处理方式。此隐私权政策旨在帮助您了解我们会收集哪些数据、为什么收集这些数据以及会利用这些数据做些什么。了解这些内容至关重要，因此我们希望您能抽出时间仔细阅读此政策。
<br><br>
本隐私权政策包含了我们收集、存储、使用、共享和保护您的个人信息的条款，我们希望通过本隐私权政策向您清晰地介绍我们对您个人信息的处理方式，因此我们建议您完整地阅读本隐私权政策，以帮助您了解维护自己隐私权的方式。如您对本隐私权政策有任何疑问，您可以通过“卡世界”公布的联系方式与我们联系。如果您不同意本隐私权政策任何内容，您应立即停止使用卡世界。当您使用“卡世界”提供的任一服务时，即表示您已同意我们按照本隐私权政策来合法使用和保护您的个人信息。
<br><br>
一、【我们收集的信息】
<br><br>
1.1 个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。
<br><br>
个人信息主体是指个人信息所标识的自然人，在下文中简称“您”。
<br><br>
收集是指对获得个人信息的控制权的行为，包括由您主动提供、通过与您交互或记录您行为等自动采集，以及通过共享、转让、搜集公开信息间接获取等方式。如果产品或服务的提供者提供工具供您使用，提供者不对个人信息进行访问的，则不属于《信息安全技术个人信息安全规范》所称的收集行为。
<br><br>
我们仅会出于实现产品及服务功能的目的，根据合法、正当、必要的原则，收集和使用您的个人信息。如果我们要将信息用于本政策未载明的其它用途或要将基于特定目的收集而来的信息用于其他目的时，我们将以合理的方式通知您，并会事先征求您的同意。例如在以下情况下，我们会向您申请授权：
<br><br>
相机。当您使用修改头像功能时，我们将向您申请获取相机、相册访问权限；
<br><br>
文件和媒体。当您修改头像访问相册照片时，我们将向您申请文件和媒体权限。
<br><br>
1.2 我们收集信息的方式如下：
<br><br>
（1）您向我们提供的信息。例如，当您注册“卡世界”帐户时，向我们提供的相关个人信息，例如您的姓名、电话号码等，这些信息会存储在您的帐户名下。
<br><br>
（2）我们在您使用服务的过程中获取的信息。我们会收集关于您使用的服务以及使用方式的信息，例如您何时访问了应用中心提供的服务，或者何时查看了我们的内容并与之互动。以及会根据您授予的权限，接收并记录您所使用的设备相关信息，包括：设备属性信息（设备型号、操作系统版本、设备设置、唯一设备标识符软硬件特征信息）、设备位置信息（通过GPS或WIFI信号获得的位置信息）、设备连接信息（IP地址）。
<br><br>
除此之外，我们在您使用服务的过程中引用了一些第三方服务，以便于为您提供更流畅的体验，包含：
https://uniapp.dcloud.io/api/plugins/push
uniPush推送 
<br><br>
除上述信息外，我们还可能为了提供服务及改进服务质量的合理需要而收集您的其他信息，包括您与我们的客户服务团队联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息，以及您与“卡世界”的关联方、“卡世界”合作伙伴之间互动时我们收集的相关信息。与此同时，为提高您使用“卡世界”提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，我们可能会通过了解一些您的网络使用习惯、您常用的软件信息等手段来判断您账户的风险，并可能会记录一些我们认为有风险的URL。
<br><br>
（3）为满足用户使用教学服务的需求而获取设备权限：麦克风权限、相册和拍照权限。
<br><br>
（4）第三方服务
<br><br>
为了给您提供更好、更优、更加个性化的服务，或共同为您提供服务，或为了预防互联网欺诈的目的，“卡世界”可能会包含第三方SDK或其他类似的应用程序，其将直接收集和处理您的信息（如以嵌入代码、插件等形式）。前述服务商收集和处理信息等行为遵守其自身的隐私条款，而不适用于本政策。但我们也会努力审查该第三方的业务准入资质并努力要求该等服务商的合法合规性与安全性。为了最大程度保障您的信息安全，我们强烈建议您先行查看其隐私条款。
<br><br>
我们的产品基于DCloud uni-app(5+ App/Wap2App)开发，应用运行期间需要收集您的设备唯一识别码（IMEI/android ID/DEVICE_ID/IDFA、SIM 卡 IMSI 信息、OAID）以提供统计分析服务，并通过应用启动数据及异常错误日志分析改进性能和用户体验，为用户提供更好的服务。详情内容请访问《DCloud用户服务条款》。
https://ask.dcloud.net.cn/protocol.html
<br><br>
消息推送服务供应商：由每日互动股份有限公司提供推送技术服务，我们可能会将您的设备平台、设备厂商、设备品牌、设备识别码等设备信息，应用列表信息、网络信息以及位置相关信息提供给每日互动股份有限公司，用于为您提供消息推送技术服务。我们在向您推送消息时，我们可能会授权每日互动股份有限公司进行链路调节，相互促活被关闭的SDK推送进程，保障您可以及时接收到我们向您推送的消息。
http://docs.getui.com/privacy
<br><br>
（5）以下信息不适用本隐私权政策：
<br><br>
a）您在使用“卡世界”提供的搜索服务时输入的关键字信息；
<br><br>
b）违反法律规定或违反“卡世界”规则行为及“卡世界”已对您采取的措施；
<br><br>
二、【我们如何使用收集到的信息】
<br><br>
因收集您的信息是为了向您提供服务及提升服务质量的目的，为了实现这一目的，我们会把您的信息用于下列用途：
<br><br>
2.1 我们会利用从所有服务中收集到的信息来提供、维护、保护和完善这些服务，同时开发新的服务并保护“卡世界”和“卡世界”用户。
<br><br>
2.2 我们可能使用您的个人信息以预防、发现、调查欺诈、危害安全、非法或违反与我们或其关联方协议、政策或规则的行为，以保护您、其他我们用户，或我们或其关联方的合法权益。
<br><br>
2.3 我们会使用通过 Cookie 和其他技术收集到的信息来提升您的用户体验，并提高我们的整体服务质量。
<br><br>
2.4 通过麦克风、相册等手机权限，以获取您的授权使用的如音频、图片等资料，用于个性化使用（如修改头像）。
<br><br>
2.5 记录设备属性信息，用于标记用户身份，提供个性化服务和产品内容。
<br><br>
2.6 经您许可的其他用途。当我们要将信息用于本隐私权政策未载明的其它用途时，则会事先征求您的同意。
<br><br>
三、【我们如何使用COOKIES和同类技术】
<br><br>
（一）COOKIES
<br><br>
COOKIES是一种可让网站服务器将数据存储于客户端或从客户端中读取数据的中立技术。COOKIES文件是存储了一些与用户访问网站有关信息的文件。COOKIES内容通常均经过加密，安全的COOKIES技术会为用户在上网时提供更为便捷的服务。
<br><br>
（二）COOKIES的使用
<br><br>
为确保网站正常运转、为您获得更轻松的访问体验，我们可能会在您的计算机或移动设备上存储名为COOKIES的小数据文件。COOKIES通常包含标识符、站点名称以及一些号码和字符。您可以在浏览器中进行相应的数据清除操作。
<br><br>
（三）同类技术
<br><br>
ETag（实体标签）是在互联网浏览器与互联网服务器之间背后传送的HTTP协议标头，可代替COOKIES。ETag可以帮助我们避免不必要的服务器负载，提高服务效率，节省资源、能源，同时，我们可能通过ETag来记录您的身份，以便我们可以更深入地了解和改善我们的产品或服务。大多数浏览器均为用户提供了清除浏览器缓存数据的功能，您可以在浏览器设置功能中进行相应的数据清除操作。但请注意，如果停用ETag，您可能无法享受相对更佳的产品或服务体验。
<br><br>
四、【您分享的信息】
<br><br>
我们的很多服务都可以让您与他人分享信息。请注意，当您公开分享资源时，会包括在“卡世界”的分享资源库的索引中。我们的服务向您提供了有关分享和删除内容的多种选项。:
<br><br>
五、【您的个人信息】
<br><br>
5.1 无论您何时使用我们的服务，我们都会力求让您顺利访问自己的个人信息。如果这些信息有误，我们会努力提供各种方式来让您快速更新信息或删除信息（除非我们出于合法业务或法律方面的原因而必须保留这些信息）。更新您的个人信息时，我们可能会先要求您验证自己的身份，然后再处理您的请求。
<br><br>
5.2 请妥善保管您的账户及密码信息。“卡世界”将通过向其它服务器备份、对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您理解在信息网络上不存在“完善的安全措施”。
<br><br>
六、【收集您个人信息的目的】
<br><br>
6.1 当您需要支付的时候，我们会收集您的基本信息、姓名、证件号码、手机号。
<br><br>
6.2 当您需要微信支付的时候，我们会获取您的微信信息、姓名、证件号码。
<br><br>
6.3 当您需要支付宝的时候，我们会获取您的支付宝信息、姓名、证件号码。
<br><br>
6.4 当您使用微信账号登陆时，我们将获取您的微信头像、微信昵称。
<br><br>
七、【收集您的权限信息】
<br><br>
7.1 文件读写权限：允许应用读取您手机内的照片，视频等信息。
<br><br>
7.2 摄像头权限：允许应用可以打开您的摄像头用于拍摄。
<br><br>
7.3 安装应用权限：允许应用安装在您的手机上。
<br><br>
7.4 网络状态权限权限：允许应用使用您的网络信息。
<br><br>
7.5 录音权限：允许应应用在您回答客服时或者是交流问题时可以使用语音的方式来回答
<br><br>
八、【我们分享的信息】
<br><br>
8.1 我们不会与“卡世界”以外的任何公司、组织和个人分享用户的个人信息，但以下情况除外：
<br><br>
（1）征得您的同意。在征得您的同意后，我们会与FansMall以外的公司、组织和个人分享您的个人信息。我们必须您选择同意才会共享任何敏感的个人信息。
<br><br>
（2）出于法律原因。如果我们确信：为了实现以下目的而有必要访问、使用、保留或披露相关信息，我们就会与“卡世界”以外的公司、组织和个人分享用户个人信息：
<br><br>
满足适用法律、法规、法律程序的要求或强制性的政府要求。
<br><br>
执行适用的服务条款（包括调查可能存在的违规情况）。
<br><br>
查找、预防或处理欺诈、安全或技术方面的问题。
<br><br>
在法律要求或允许的范围内，保护“卡世界”、“卡世界”用户或公众的权利、财产或安全免遭损害。
<br><br>
8.2 我们可能会与公众以及合作伙伴分享汇总的非个人身份信息。例如，我们会对外公开，让公众了解“卡世界”的整体使用趋势。
<br><br>
九、【适用范围】
<br><br>
9.1 我们的隐私权政策适用于由“卡世界”及登陆相关客户端使用“卡世界”台提供的所有服务。
<br><br>
9.2 政策的遵守以及与监管机构的配合
<br><br>
我们会定期检查隐私权政策的遵守情况。此外，我们还遵循一些自我监管框架。我们收到正式的书面投诉后，会与投诉人联系，以便采取进一步行动。我们会与相应的监管机构（包括当地的数据保护机构）合作，以解决“卡世界”与用户之间无法直接解决的有关个人数据转让的投诉问题。
<br><br>
9.3 需要特别说明的是，本隐私权政策不适用于其他第三方向您提供的服务，例如第三方应用依托“卡世界”向您提供服务时，您向第三方应用提供的个人信息不适用于本隐私权政策。
<br><br>
十、【未成年人保护】
<br><br>
我们十分重视未成年人的个人信息保护，如您为未成年人，建议您请您的父母或监护人仔细阅读本隐私政策，并在征得您的父母或监护人同意的前提下使用我们的服务或向我们提供信息。
<br><br>
十一、【变更】
<br><br>
我们的隐私权政策随时都可能变更。未经您明确同意，我们不会削减您按照本隐私权政策所应享有的权利。我们会在本页面上发布对隐私权政策所做的任何变更。对于重大变更，我们还会提供更为显著的通知（包括对于某些服务，我们会通过电子邮件发送通知，说明隐私权政策的具体变更内容）。我们还会将本隐私权政策的旧版本存档，供您查阅。
<br><br>
十二、【账号注销】
<br><br>
1.我们的官方渠道为您提供了在线客服功能，您可以直接与我们的客服联系进行账号注销；
<br><br>
2.为保障您的账号安全和财产权益，我们需要进行注销申请的身份验证（例如：验证账号绑定的手机号码等），以确保该账号真的
`;
  onLoad(query: any) {}
}
</script>

<style lang="scss">
.privacy-index {
  width: 100%;
  box-sizing: border-box;
  padding: 20rpx;
}
.bottom-desc {
  width: 100%;
  box-sizing: border-box;
  padding: 0 20rpx;
  margin-top: 20rpx;
  font-size: 30rpx;
}
</style>
