<template>
  <view class="privacy-index">
    <view class="bottom-desc" v-html="html"></view>
  </view>
</template>

<script lang="ts">
import { Component } from "vue-property-decorator";
import BaseNode from "../../base/BaseNode.vue";
@Component({})
export default class ClassName extends BaseNode {
  html = `【卡世界社区行为规范】
<br><br>
卡世界致力于提供一个由用户创造高质量内容的卡牌收藏社区。为了保护用户创造的内容、维护良好的社区氛围，社区管理员将依据用户协议和本规范中的条款对卡世界的注册用户和发布在卡世界的内容进行管理。采取的措施包括但不限于更改或删除用户发布的内容、暂停或终止用户使用卡世界社区的权利。
<br><br>
所有有意的降低内容质量、伤害社区氛围的行为（下称「破坏」）都是不能容忍的。多数情况下社区中的其他用户会优先选择对破坏行为做出劝诫、建议和引导，卡世界团队也会先发出警告并给予用户改正自己不当行为的机会，但不表示卡世界团队在采取任何措施前必须首先发出警告。
<br><br>
违规行为界定
<br><br>
1.反对宪法所确定的基本原则：
<div></div>
· 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一
<div></div>
· 损害国家荣誉和利益
<div></div>
· 煽动民族仇恨、民族歧视，破坏民族团结
<div></div>
· 侮辱、滥用英烈形象，否定英烈事迹，美化粉饰侵略战争行为的
<div></div>
· 破坏国家宗教政策，宣扬邪教和封建迷信
<div></div>
· 散布谣言，扰乱社会秩序，破坏社会稳定
<div></div>
· 宣扬淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪
<div></div>
· 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序
<div></div>
· 诽谤他人，泄露他人隐私，侵害他人合法权益
<div></div>
· 含有法律、行政法规禁止的其他内容的信息
<br><br>
2.不友善行为，主要表现为：
<div></div>
· 人身攻击及辱骂他人。
<div></div>
· 针对以下群体发表诅咒、歧视、漠视生命尊严等性质的言论，群体包括：国籍、地域、性别、性别认同、性倾向、种族、疾病、宗教、残障群体等。
<div></div>
· 对他人进行诅咒、恐吓或威胁，尤其是死亡威胁。
<div></div>
· 针对其他用户的私德、观点立场、素质、能力等方面的贬低或不尊重。
<div></div>
· 讽刺其他用户，阴阳怪气地表达批评。
<div></div>
· 对其他用户创作的内容直接进行贬低性的评论。
<div></div>
· 对其他用户使用粗俗用语，并产生了冒犯。
<div></div>
· 针对以下群体发表偏见性质的言论，群体包括：国籍、地域、性别、性别认同、性倾向、种族、疾病、宗教、残疾人群体等。
<br><br>
3.发布垃圾广告信息：用户以推广曝光为目的，发布影响用户体验、扰乱卡世界社区秩序的内容，或进行相关行为。
<div></div>
· 多次发布包含售卖产品、提供服务、宣传推广内容的垃圾广告。包括但不限于以下几种形式：
<div></div>
&nbsp o 单个帐号多次发布包含垃圾广告的内容
<div></div>
&nbsp o 多个广告帐号互相配合发布包含垃圾广告的内容
<div></div>
&nbsp o 多次发布包含欺骗性外链的内容，如未注明的淘宝客链接、跳转网站等，诱骗用户点击链接
<div></div>
&nbsp o 发布大量包含 SEO 推广链接、产品、品牌等内容获取搜索引擎中的不正当曝光
<div></div>
· 购买或出售帐号之间虚假地互动，发布干扰社区秩序的推广内容及相关交易。包括但不限于以下几种形式：
<div></div>
&nbsp o 购买机器注册帐号，或人工操控帐号的关注，伪造在社区内的影响力
<div></div>
&nbsp o 购买机器注册帐号，或人工操控帐号点击赞同，谋求回答的不正当曝光
<div></div>
&nbsp o 使用机器、恶意程序手段或人为有组织性地操控帐号进行点赞、评论等扰乱秩序的行为
<div></div>
· 使用严重影响用户体验的违规手段进行恶意营销。包括但不限于以下几种形式：
<div></div>
&nbsp o 不规范转载或大篇幅转载他人内容同时加入推广营销内容
<div></div>
&nbsp o 发布包含欺骗性的恶意营销内容，如通过伪造经历、冒充他人等方式进行恶意营销
<div></div>
· 使用特殊符号、图片等方式规避垃圾广告内容审核的广告内容
<div></div>
· 恶意注册使用edge帐号，包括但不限于机器注册、频繁注册、批量注册、滥用多个edge帐号
<br><br>
4.恶意行为：滥用产品功能，进行影响用户体验，危及平台安全及损害他人权益的行为。主要表现为：
<div></div>
· 恶意编辑，指清空或删除有效内容，添加无关信息，破坏内容结构等降低公共编辑内容质量的编辑。
<div></div>
· 冒充他人，通过头像、用户名等个人信息暗示自己与他人或机构相等同或有关联。
<div></div>
· 重复发布干扰正常用户体验的内容。包括但不限于以下几种形式：
<div></div>
&nbsp o 重复的回答内容多次发布在不同笔记下；
<div></div>
&nbsp o 频繁发布难以辨识涵义影响阅读体验的字符、数字等无意义乱码；
<div></div>
&nbsp o 骚扰他人，以评论、@他人、私信等方式对他人反复发送重复或者相似的诉求。
<div></div>
· 诱导投票或关注，如通过点赞抽奖、集赞更新等形式诱导投票或者诱导关注。
<div></div>
· 制作及传播外挂或者用于操作帐号功能的恶意程序或相关教程。
<div></div>
· 发布含有潜在危险的内容，或使用第三方网站伪造跳转链接，如钓鱼网站、木马、病毒网站等。
<div></div>
· 发布带有假冒伪劣商品信息的内容
<div></div>
· 恶意对抗行为，包括但不限于使用变体、谐音等方式规避安全审查，明知相关行为违反法律法规和社区规范仍然多次发布等。
<br><br>
5.其他禁止的行为：
<div></div>
· 严禁以非法民间组织名义活动
<div></div>
· 严禁发布引导私下交易或向微信及其他平台引流的广告
<br><br>
违规行为处理流程
<div></div>
站方通过主动发现和接受用户举报两种方式发现违规行为。用户可以使用内容页面上的「举报」功能对涉嫌违规的行为和用户进行举报。违规的信息由edge团队根据本规定直接处理。
<br><br>
补充
<div></div>
卡世界团队可以随着社区管理经验的不断丰富，出于维护卡世界社区氛围和秩序的目的，不断完善本规定。
<br><br>
帐号注销流程
<div></div>
为了避免被盗号或非本人操作带来的损失，注销前需要确认帐号所属，以及进行可能涉及的虚拟财产结算。如希望注销帐号，请联系卡世界客服，我们会进行人工确认及处理。
<br><br>
· 关于站内侵权内容的处理细则
<div></div>
卡世界用户的名誉权、肖像权，隐私权或知识产权等合法权利受到侵害时，可以向edge提交侵权举报。edge站方依据用户提交的侵权举报信息，对涉及侵权的内容做删除或建议修改处理。
<br><br>
卡世界会处理哪些内容？
<div></div>
（1）涉及侮辱、诽谤他人的内容，表现为故意捏造并散布虚构的事实，足以贬损他人人格，破坏他人名誉。
<div></div>
（2）涉及透露他人隐私的内容，常见情况是未经允许发布包含不为人所知的私生活秘密信息的内容，如姓名、年龄、任职单位、职业、照片等，但权利人曾公开发布的个人信息除外；
<div></div>
（3）涉及泄露商业秘密的内容，常见情况是企业员工未经授权发布透露企业不为人知且采取了保密措施的技术信息或经营信息；
<div></div>
（4）涉及侵犯他人知识产权的内容，常见情况是未经授权将他人的版权内容（包括文章、图片和视频等）发布至站内；
<div></div>
（5）其他涉及侵犯他人合法权益的内容。
<br><br>
本社区管理规定即日起生效，您承诺在卡世界社区的一切活动均不会违反本规定。您若对本规定由任何疑问，可联系卡世界客户进行咨询。相关解释权归卡世界 app所有，欢迎用户对该协议提出修改和完善建议。
<br><br>
更新时间：2023年 7月 24日
<br><br>
生效时间：2023年 7月 24日
<br><br>
<br><br>
<br><br>
<br><br>
`;
  onLoad(query: any) {}
}
</script>

<style lang="scss">
.privacy-index {
  width: 100%;
  box-sizing: border-box;
  padding: 20rpx;
}
.bottom-desc {
  width: 100%;
  box-sizing: border-box;
  padding: 0 20rpx;
  margin-top: 20rpx;
  font-size: 30rpx;
  word-break: break-all
}
</style>
